Fese673/ZEGAR-ESP32/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <WiFi.h>
#include <time.h>
#include <Esp.h>

#include "STM32_Data.h"
#include "LCDMirror.h"
#include "UI_Controller.h"
#include "Encoder.h"
#include "AppState.h"
#include "UI_Draw.h"
#include "WiFiSync.h"
#include "RTCService.h"

#include <sys/time.h>
#include "MQTTSync.h"
#include "StatsManager.h" 
#include "AudioBT.h" 
#include "ModeManager.h"
#include "RadioModeSwitch.h"
#include "PMS_Czujnik.h"
#include "ENS160AHT21Screen.h"
#include "ENS160AHT21Sensor.h"
#include "BMP280Screen.h"
#include "BMP280Sensor.h"
#include "LCDIcons.h"
#include "AlarmMelodies.h"
#include <cstring>
#include <DHT.h>
#include "TemperatureConfig.h"
#include "I2C_bus_shared.h"
#include <Preferences.h>

// ============================================================================
// STAŁE CZASOWE (zamiast magic numbers)
// ============================================================================
constexpr unsigned long CLOCK_TICK_MS       = 1000; // tykanie zegara co 1s
constexpr unsigned long ALARM_DURATION_MS   = 60000; // jak długo gra alarm
constexpr unsigned long STM32_UPDATE_MS     = 500;  // odświeżanie danych STM32
constexpr unsigned long STM32_TIMEOUT_MS    = 3000; // timeout połączenia STM32
constexpr unsigned long STOPER_DRAW_MS      = 100;  // odświeżanie stopera
constexpr unsigned long WIFI_RETRY_DELAY_MS = 500;  // próba połączenia WiFi
constexpr int           WIFI_MAX_RETRIES    = 20;   // max prób połączenia
constexpr unsigned long MSG_DISPLAY_MS      = 1500; // wyświetlanie komunikatów

// ============================================================================
// HOME LCD refresh policy
// ============================================================================
// Wymóg: ekran HOME (LCD + UART mirror) ma odświeżać się maks. 1x/s.
// Zamiast wołać drawHome() bezpośrednio z wielu miejsc, używamy bramki:
// - requestHomeRedraw(): zaznacza, że HOME wymaga odświeżenia
// - serviceHomeRedraw(): wykonuje drawHome() nie częściej niż co 1000ms
static bool          s_homeRedrawDirty      = true;
static unsigned long s_lastHomeRedrawMs    = 0;
static constexpr unsigned long HOME_REDRAW_MIN_INTERVAL_MS = 1000;

enum class HomeUiProfile : uint8_t {
  Minimal  = 0,
  Balanced = 1,
  Extreme  = 2,
};

enum class HomeOverlayPage : uint8_t {
  Time            = 0,
  Indoor          = 1,
  Outdoor         = 2,
  Extreme         = 3,
  Systems         = 4,
  ExtremeAlgos    = 5,
};

static HomeUiProfile   s_homeUiProfile       = HomeUiProfile::Minimal;
static HomeOverlayPage s_homeOverlay         = HomeOverlayPage::Time;
static uint8_t         s_homeOverlayIndex    = 0;
static unsigned long   s_homeOverlaySinceMs  = 0;
static unsigned long   s_homeIndoorAnimSinceMs = 0;
// Runtime-configurable overlay switch interval (ms). Persisted via Preferences as seconds.
unsigned long s_homeOverlaySwitchMs = 7000; // default 7s
int settingsRotationSec = 7;               // 1..10 seconds (user-facing)
int s_prevSettingsRotationSec = 7;         // used to restore on cancel
int s_prevSettingsUiScreenIndex = 0;        // used to restore UI screen selection on cancel

extern int settingsUiScreenIndex;

constexpr uint8_t BUZZER_PIN = 19;

enum class IntroPhase : uint8_t {
  Idle,
  Noise,
  AuthHold,
  FrameBuild,
  Reveal,
  FlashOn,
  FlashOff,
  SuccessReady,
  SuccessRiff,
  Done,
};

static void introPrintPaddedLine(uint8_t row, const char* text);
static void introPrintCentered(uint8_t row, const char* text);
static void introPrintBorderLine(uint8_t row, char leftCorner, char rightCorner);
static void introRenderNoiseFrame();
static void renderAuthIntroFrame();
static void renderTickingFrameBase();
static void renderTickingFrameText(uint8_t revealCount);

struct BootIntroState {
  IntroPhase phase = IntroPhase::Idle;
  unsigned long phaseStartedMs = 0;
  unsigned long lastNoiseMs = 0;
  unsigned long lastRevealMs = 0;
  unsigned long flashStartedMs = 0;
  unsigned long riffStartedMs = 0;
  uint8_t revealIndex = 0;
  uint8_t flashCount = 0;
  uint8_t riffIndex = 0;
  bool backlightOn = true;
};

static BootIntroState s_intro;

static size_t boundedTextLength(const char* text, size_t maxLength) {
  if (text == nullptr) {
    return 0;
  }

  size_t length = 0;
  while (length < maxLength && text[length] != '\0') {
    ++length;
  }

  return length;
}

static void introPrintPaddedLine(uint8_t row, const char* text) {
  char line[21];
  const size_t length = boundedTextLength(text, 20);
  memset(line, ' ', 20);
  memcpy(line, text, length);
  line[20] = '\0';
  LCD_SET(0, row);
  LCD_PRINT(line);
}

static void introPrintCentered(uint8_t row, const char* text) {
  constexpr size_t width = 20;
  const size_t length = boundedTextLength(text, width);
  char line[21];
  memset(line, ' ', width);
  const size_t start = (width - length) / 2;
  memcpy(line + start, text, length);
  line[width] = '\0';
  LCD_SET(0, row);
  LCD_PRINT(line);
}

static void introPrintBorderLine(uint8_t row, char leftCorner, char rightCorner) {
  LCD_SET(0, row);
  LCD_PRINT(leftCorner);
  LCD_PRINT(F("=================="));
  LCD_PRINT(rightCorner);
}

static void introRenderNoiseFrame() {
  LCD_CLEAR();
  for (uint8_t row = 0; row < 4; ++row) {
    char line[21];
    for (uint8_t col = 0; col < 20; ++col) {
      static const char noiseChars[] = {'.', ':', '*', '#', '@', ' ', '/'};
      line[col] = noiseChars[random(0, (int)(sizeof(noiseChars) / sizeof(noiseChars[0])))];
    }
    line[20] = '\0';
    LCD_SET(0, row);
    LCD_PRINT(line);
  }
  LCD_DUMP();
}

static void renderAuthIntroFrame() {
  LCD_CLEAR();
  introPrintPaddedLine(0, "[ QUANTUM CORE OS ]");
  introPrintPaddedLine(1, "  AUTH: D.  MELCER  ");
  introPrintPaddedLine(2, "  AUTH: R. WOZNIAK  ");
  introPrintPaddedLine(3, "VERIFYING CREDENTIAL");
  LCD_DUMP();
}

static void renderTickingFrameBase() {
  LCD_CLEAR();
  introPrintBorderLine(0, '.', '.');
  LCD_SET(0, 1);
  LCD_PRINT(F("|                  |"));
  LCD_SET(0, 2);
  LCD_PRINT(F("|                  |"));
  introPrintBorderLine(3, '\'', '\'');
  LCD_DUMP();
}

