Fese673/ZEGAR-ESP32/src/main.cpp
// --- Menu Zasobów Systemu ---
int resourcesMenuIndex = 0;
const char* resourcesMenuItems[] = {
  "RAM Free",
  "CPU",
  "Flash Free"
};
constexpr int RESOURCES_MENU_COUNT = 3;
int resourcesMenuCount = RESOURCES_MENU_COUNT;

// --- Menu PMS5003 ---
int pms5003MenuIndex = 0;
const char* pms5003MenuItems[] = {
  "Tryb Fabryczny",
  "Tryb Atmosferyczny",
  "L.Czastek #/100cm3",
  "Telemetria",
};
constexpr int PMS5003_MENU_COUNT = 4;
int pms5003MenuCount = PMS5003_MENU_COUNT;

// --- Menu ENS160 + AHT21 ---
int ens160MenuIndex = 0;
const char* ens160MenuItems[] = {
  "AQI",
  "TVOC",
  "eCO2",
};
constexpr int ENS160_MENU_COUNT = 3;
int ens160MenuCount = ENS160_MENU_COUNT;

// --- Menu BMP280 ---
int bmp280MenuIndex = 0;
const char* bmp280MenuItems[] = {
  "Temperature",
  "Pressure",
  "Status",
  "Altitude"
};

// --- Menu PMS5003 CF=1 ---
int pms5003CF1MenuIndex = 0;
const char* pms5003CF1MenuItems[] = {
  "PM1.0",
  "PM2.5",
  "PM10"
};
constexpr int PMS5003_CF1_MENU_COUNT = 3;
int pms5003CF1MenuCount = PMS5003_CF1_MENU_COUNT;

// --- Menu PMS5003 ATM ---
int pms5003ATMMenuIndex = 0;
const char* pms5003ATMMenuItems[] = {
  "PM1.0",
  "PM2.5",
  "PM10"
};
constexpr int PMS5003_ATM_MENU_COUNT = 3;
int pms5003ATMMenuCount = PMS5003_ATM_MENU_COUNT;

// --- Menu PMS5003 PARTICLE COUNT ---
int pms5003ParticlesMenuIndex = 0;
const char* pms5003ParticlesMenuItems[] = {
  "0.3um",
  "0.5um",
  "1.0um",
  "2.5um",
  "5.0um",
  "10.0um"
};
constexpr int PMS5003_PARTICLES_MENU_COUNT = 6;
int pms5003ParticlesMenuCount = PMS5003_PARTICLES_MENU_COUNT;

// --- Menu Ustawień ---
int settingsMenuIndex = 0;
const char* settingsMenuItems[] = {
  "PMS5003",
  "Buzzer",
  "MQTT",
  "Alarmy",
  "Synchronizacja",
  "Rotacja Ekranu",
  "UI ekran",
  "Boot Intro",
  "Wyjscie"
};
constexpr int SETTINGS_MENU_COUNT = 9;
int settingsMenuCount = SETTINGS_MENU_COUNT;

// --- Menu: Synchronizacja ---
int settingsSyncMinutes = 60;
int s_prevSettingsSyncMin = 60;

// --- Menu Ustawienia UI EKRAN ---
const char* settingsUiScreenItems[] = {
  "Minimal",
  "Balanced",
  "Extreme"
};
constexpr int SETTINGS_UI_SCREEN_COUNT = 3;
int settingsUiScreenCount = SETTINGS_UI_SCREEN_COUNT;

// --- Menu Ustawienia PMS5003 ---
int settingsPmsMenuIndex = 0;
const char* settingsPmsMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_PMS_MENU_COUNT = 2;
int settingsPmsMenuCount = SETTINGS_PMS_MENU_COUNT;

// --- Menu Ustawienia Buzera ---
int settingsBuzzerMenuIndex = 0;
const char* settingsBuzzerMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_BUZZER_MENU_COUNT = 2;
int settingsBuzzerMenuCount = SETTINGS_BUZZER_MENU_COUNT;

// --- Menu Ustawienia MQTT ---
int settingsMqttMenuIndex = 0;
const char* settingsMqttMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_MQTT_MENU_COUNT = 2;
int settingsMqttMenuCount = SETTINGS_MQTT_MENU_COUNT;

// --- PMS5003 Telemetry ---
uint16_t pms5003_errorCount_current = 0;
uint16_t pms5003_errorCount_total = 0;
uint16_t pms5003_bytesReceived = 0;
uint32_t pms5003_lastFrameTime = 0;
uint32_t pms5003_latency_ms = 0;

// --- PMS5003 Current Values ---
uint16_t pms5003_PM1_0_CF1 = 0;
uint16_t pms5003_PM2_5_CF1 = 0;
uint16_t pms5003_PM10_CF1 = 0;

uint16_t pms5003_PM1_0_ATM = 0;

static void requestHomeRedraw();

static int loadAlarmMelodyIndexFromPrefs() {
  String savedMelodyId = s_prefs.getString("alarmMelodyId", "");
  if (savedMelodyId.length() > 0) {
    int loadedIndex = AlarmMelodies::indexOfId(savedMelodyId.c_str());
    if (loadedIndex >= 0 && loadedIndex < AlarmMelodies::kCount) {
      return loadedIndex;
    }
  }

  int loadedIndex = (int)s_prefs.getUShort("alarmMelody", 0);
  if (loadedIndex < 0) loadedIndex = 0;
  if (loadedIndex >= AlarmMelodies::kCount) loadedIndex = AlarmMelodies::kCount - 1;
  return loadedIndex;
}

static uint8_t homeOverlayCountForProfile(HomeUiProfile profile) {
  switch (profile) {
    case HomeUiProfile::Minimal:
      return 2;
    case HomeUiProfile::Balanced:
      return 3;
    case HomeUiProfile::Extreme:
      return 6;
  }
  return 2;
}

static HomeOverlayPage homeOverlayPageFor(HomeUiProfile profile, uint8_t index) {
  switch (profile) {
    case HomeUiProfile::Minimal:
      return (index % 2 == 0) ? HomeOverlayPage::Time : HomeOverlayPage::Outdoor;
    case HomeUiProfile::Balanced:
      switch (index % 3) {
        case 0: return HomeOverlayPage::Time;
        case 1: return HomeOverlayPage::Indoor;
        default: return HomeOverlayPage::Outdoor;
      }
    case HomeUiProfile::Extreme:
      switch (index % 6) {
        case 0: return HomeOverlayPage::Time;
        case 1: return HomeOverlayPage::Indoor;
        case 2: return HomeOverlayPage::Outdoor;
        case 3: return HomeOverlayPage::Extreme;
        case 4: return HomeOverlayPage::Systems;
        default: return HomeOverlayPage::ExtremeAlgos;
      }
  }
  return HomeOverlayPage::Time;
}

static void syncHomeOverlayToProfile(bool resetTimer) {
  const uint8_t overlayCount = homeOverlayCountForProfile(s_homeUiProfile);
  if (overlayCount == 0) {
    s_homeOverlayIndex = 0;
    s_homeOverlay = HomeOverlayPage::Time;
    s_homeOverlaySinceMs = 0;
    s_homeIndoorAnimSinceMs = 0;
    requestHomeRedraw();
    return;
  }

  if (s_homeOverlayIndex >= overlayCount) {
    s_homeOverlayIndex = 0;
  }

  s_homeOverlay = homeOverlayPageFor(s_homeUiProfile, s_homeOverlayIndex);
  if (resetTimer) {
    s_homeOverlaySinceMs = millis();
    s_homeIndoorAnimSinceMs = s_homeOverlay == HomeOverlayPage::Indoor ? s_homeOverlaySinceMs : 0;
  }
  requestHomeRedraw();
}

static void requestHomeRedraw() {
  s_homeRedrawDirty = true;
}

static void serviceHomeRedraw() {
  if (appState != STATE_HOME) return;
  if (!s_homeRedrawDirty) return;

  const unsigned long nowMs = millis();
  if (s_lastHomeRedrawMs != 0 && (nowMs - s_lastHomeRedrawMs) < HOME_REDRAW_MIN_INTERVAL_MS) {
    return;
  }

  s_lastHomeRedrawMs = nowMs;
  s_homeRedrawDirty  = false;

  switch (s_homeOverlay) {
    case HomeOverlayPage::Indoor:
      drawIndoorWeatherScreen();
      break;
    case HomeOverlayPage::Outdoor:
      drawAirScreen();
      break;
    case HomeOverlayPage::Extreme:
      drawExtremeEnvironmentScreen();
      break;
    case HomeOverlayPage::Systems:
      drawSystemResources();
      break;
    case HomeOverlayPage::ExtremeAlgos:
      drawExtremeAlgorithmScreen();
      break;
    case HomeOverlayPage::Time:
    default:
      drawHome();
      break;
  }
}

static void drawHomeThrottled() {
  requestHomeRedraw();
  serviceHomeRedraw();
}

static void serviceHomeOverlayRotation() {
  if (appState != STATE_HOME) return;

  const unsigned long nowMs = millis();
  const uint8_t overlayCount = homeOverlayCountForProfile(s_homeUiProfile);
  if (overlayCount == 0) {
    return;
  }

