Fese673/ZEGAR-ESP32/src/main.cpp
  // Additional sanity: ignore clearly invalid timestamps.
  if (epoch < 1609459200) {
    Serial.println("[RTC] epoch too old/invalid; ignoring");
    return;
  }

  timeval tv;
  tv.tv_sec = epoch;
  tv.tv_usec = 0;
  settimeofday(&tv, nullptr);

  lastTick = millis();
  syncLocalClockFromSystemTime();
  Serial.printf("[RTC] system time restored from DS3231 (local %02d:%02d:%02d)\n", hours, minutes, seconds);
}

static void handleRtcWriteIfPending() {
  if (!rtcWritePending) return;
  if (!RTCService::isReady()) return;
  if (!isSystemTimeValid()) return;

  const unsigned long nowMs = millis();

  if (nowMs < rtcWriteNotBeforeMillis) return;
  // Avoid hammering the device on repeated failures.
  if (lastRtcWriteAttemptMillis != 0 && (nowMs - lastRtcWriteAttemptMillis) < 1000UL) return;

  const time_t epochToWrite = (rtcPendingEpoch != 0) ? rtcPendingEpoch : time(nullptr);
  const RTCService::Status st = RTCService::setEpoch(epochToWrite, true);
  Serial.printf("[RTC] setEpoch: %s epoch=%ld\n", RTCService::statusToString(st), (long)epochToWrite);
  lastRtcWriteAttemptMillis = nowMs;

  if (st == RTCService::Status::Ok) {
    rtcWritePending = false;
    rtcPendingEpoch = 0;
    rtcWriteFailureCount = 0;
    rtcWriteNotBeforeMillis = 0;
    return;
  }

  rtcWriteFailureCount++;
  rtcWriteNotBeforeMillis = nowMs + rtcComputeBackoffMs(rtcWriteFailureCount);
}

// --- MQTT Mode Control ---
static bool mqtt_initialized = false;
static RadioModeSwitchState last_radio_mode = RADIO_STATE_WIFI;
bool mqttEnabled = true;

// --- DHT Sensor ---
DHT dht(DHT_PIN, DHT_TYPE);
bool dhtScreenDirty = true;
int  savedHours     = 0;
int  savedMinutes   = 0;
int  savedSeconds   = 0;
bool timeSaved      = false;

// Flaga do wymuszenia rysowania ekranów PMS5003 przy wejściu do podmenu
bool pmsScreenDirty = true;

// Odczyty DHT
float dhtTemperature = 0.0f; // compensated (used by app)
float dhtTemperatureRaw = 0.0f; // raw sensor reading for diagnostics
float dhtHumidity    = 0.0f;

// Stabilizacja odczytów
bool dhtReady = false;
unsigned long dhtLastRead = 0;
constexpr unsigned long DHT_READ_INTERVAL_MS = 2000;

static void buildMqttTelemetrySample(float &temperatureC, int &humidityPct, int &pressureHpa,
                                     uint8_t &aqi, uint16_t &tvoc, uint16_t &eco2) {
  temperatureC = 0.0f;
  humidityPct = 0;
  pressureHpa = 0;
  aqi = 0;
  tvoc = 0;
  eco2 = 0;

  if (BMP280Screen::runtimeData.hasTemperature) {
    temperatureC = BMP280Screen::runtimeData.temperatureC;
  } else if (ENS160AHT21Screen::runtimeData.hasClimateSample) {
    temperatureC = ENS160AHT21Screen::runtimeData.temperatureC;
  } else {
    temperatureC = dhtTemperature;
  }

  if (ENS160AHT21Screen::runtimeData.hasClimateSample) {
    humidityPct = (int)ENS160AHT21Screen::runtimeData.humidityPct;
  } else {
    humidityPct = (int)dhtHumidity;
  }

  if (BMP280Screen::runtimeData.hasPressure) {
    pressureHpa = (int)BMP280Screen::runtimeData.pressureHpa;
  }

  if (ENS160AHT21Screen::runtimeData.hasGasSample) {
    aqi = ENS160AHT21Screen::runtimeData.aqi;
    tvoc = ENS160AHT21Screen::runtimeData.tvoc;
    eco2 = ENS160AHT21Screen::runtimeData.eco2;
  }
}

float computeDewPoint(float temperatureC, float humidityPct) {
  const float b = 17.625f;
  const float c = 243.04f;

  if (!isfinite(temperatureC) || !isfinite(humidityPct) || humidityPct <= 0.0f || humidityPct > 100.0f) {
    return NAN;
  }

  const float rh = humidityPct;
  const float gamma = logf(rh / 100.0f) + (b * temperatureC) / (c + temperatureC);
  return (c * gamma) / (b - gamma);
}

float computeHumidex(float temperatureC, float humidityPct) {
  if (!isfinite(temperatureC) || !isfinite(humidityPct) || humidityPct <= 0.0f || humidityPct > 100.0f) {
    return NAN;
  }

  // Humidex (Meteorological Service of Canada) z RH i temperatury.
  // Wynik sensowny w praktyce dla T >= 20°C oraz RH >= 40%.
  if (temperatureC < 20.0f || humidityPct < 40.0f) {
    return NAN;
  }

  const float e = 6.112f * powf(10.0f, (7.5f * temperatureC) / (237.7f + temperatureC)) * (humidityPct / 100.0f);
  return temperatureC + (5.0f / 9.0f) * (e - 10.0f);
}

float computeHeatIndexNWS(float temperatureC, float humidityPct) {
  if (!isfinite(temperatureC) || !isfinite(humidityPct) || temperatureC < 27.0f || humidityPct < 40.0f) {
    return NAN;
  }

  float T = temperatureC * 9.0f / 5.0f + 32.0f;
  float RH = humidityPct;

  float HI = -42.379f
    + 2.04901523f * T
    + 10.14333127f * RH
    - 0.22475541f * T * RH
    - 0.00683783f * T * T
    - 0.05481717f * RH * RH
    + 0.00122874f * T * T * RH
    + 0.00085282f * T * RH * RH
    - 0.00000199f * T * T * RH * RH;

  // poprawki (opcjonalne) mogłyby zostać dodane, ale nie są konieczne w prostym modelu.
  return (HI - 32.0f) * 5.0f / 9.0f;
}

float computeAbsoluteHumidity(float temperatureC, float humidityPct) {
  if (!isfinite(temperatureC) || !isfinite(humidityPct) || humidityPct < 0.0f || humidityPct > 100.0f) {
    return NAN;
  }

  const float Rw = 461.5f; // J/(kg·K)
  const float Tk = temperatureC + 273.15f;
  if (Tk <= 0.0f) {
    return NAN;
  }

  const float Ps = 611.2f * expf((17.625f * temperatureC) / (243.04f + temperatureC)); // Pa
  const float Pv = (humidityPct / 100.0f) * Ps;
  // wynik g/m^3
  return (Pv / (Rw * Tk)) * 1000.0f;
}


// ============================================================================
// IMPLEMENTACJA FUNKCJI - LOGIKA ZEGARA
// ============================================================================

void tickClock() {
  if (appState == STATE_SET_TIME) return;

  const unsigned long nowMs = millis();

  if (isSystemTimeValid()) {
    if (nowMs - lastTick >= CLOCK_TICK_MS) {
      // align tick
      lastTick = nowMs - ((nowMs - lastTick) % CLOCK_TICK_MS);
      syncLocalClockFromSystemTime();
      if (appState != STATE_STOPER) updateSevenSeg();
      if (appState == STATE_HOME) requestHomeRedraw();
    }
  } else {
    // catch up missed ticks
    if (nowMs - lastTick >= CLOCK_TICK_MS) {
      int loops = 0;
      unsigned long now = nowMs;
      while (now - lastTick >= CLOCK_TICK_MS && loops < 60) {
        lastTick += CLOCK_TICK_MS;
        seconds++;
        if (seconds >= 60) {
          seconds = 0;
          minutes++;
          if (minutes >= 60) {
            minutes = 0;
            hours = (hours + 1) % 24;
          }
        }
        loops++;
      }
      if (appState != STATE_STOPER) updateSevenSeg();
      if (appState == STATE_HOME) requestHomeRedraw();
    }
  }

  // Check alarms (multi)
  if (!alarmRinging && seconds == 0 && alarmsCount > 0) {
    time_t now_t = time(nullptr);
    struct tm timeinfo;
    localtime_r(&now_t, &timeinfo);
    int today = timeinfo.tm_yday;
    for (int i = 0; i < alarmsCount; ++i) {
      if (!alarms[i].enabled) continue;
      if (alarms[i].hour == hours && alarms[i].minute == minutes && alarms[i].lastTriggerDay != (uint16_t)today) {
        alarmRinging = true;
        alarmStartTime = millis();
        alarms[i].lastTriggerDay = (uint16_t)today;
        AlarmMelodies::start((uint8_t)settingsAlarmMelodyIndex, BUZZER_PIN);
        break;
      }
    }
  }

  // Timer expiry
  if (timerRunning) {
    unsigned long elapsed = millis() - timerStartMillis;
    if (elapsed >= timerDurationMs) {
      timerRunning = false;
      alarmRinging = true;
      alarmStartTime = millis();
      AlarmMelodies::start((uint8_t)settingsAlarmMelodyIndex, BUZZER_PIN);
      editState = EDIT_HOURS;
      timerStartMillis = 0;
      timerDurationMs = 0;
    }
  }
}


// ============================================================================
// IMPLEMENTACJA FUNKCJI - ALARM / BUZZER
// ============================================================================

void playAlarmMelody() {
  AlarmMelodies::service(BUZZER_PIN, millis());
}

void startAlarmMelodyDemo(uint8_t melodyIndex) {
  AlarmMelodies::start(melodyIndex, BUZZER_PIN);
  s_alarmMelodyDemoActive = true;
  s_alarmMelodyDemoEndMs = millis() + 10000UL;
}

void stopAlarmMelodyDemo() {
  if (!s_alarmMelodyDemoActive) {
    return;
  }

