Fese673/ZEGAR-ESP32/src/main.cpp
  AlarmMelodies::stop(BUZZER_PIN);
  s_alarmMelodyDemoActive = false;
  s_alarmMelodyDemoEndMs = 0;
}

// ============================================================================
// MONITOROWANIE ZASOBÓW SYSTEMU
// ============================================================================

void updateSystemResources() {
  unsigned long currentTime = millis();
  
  // Aktualizuj co ~1 sekundę
  if (currentTime - lastCpuReadTime < 1000) {
    return;
  }
  
  lastCpuReadTime = currentTime;
  
  // --- CPU Load ---
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();
  
  uint32_t usedHeap = totalHeap - freeHeap;
  cpuLoadPercent = (usedHeap * 100) / totalHeap;
  
  if (cpuLoadPercent > 80) {
    cpuCore0Percent = cpuLoadPercent - 5;
    cpuCore1Percent = cpuLoadPercent;
  } else if (cpuLoadPercent > 60) {
    cpuCore0Percent = cpuLoadPercent + 5;
    cpuCore1Percent = cpuLoadPercent - 5;
  } else {
    cpuCore0Percent = cpuLoadPercent + 10;
    cpuCore1Percent = cpuLoadPercent;
  }
  
  if (cpuCore0Percent > 100) cpuCore0Percent = 100;
  if (cpuCore1Percent > 100) cpuCore1Percent = 100;
  
  // --- RAM Free ---
  ramFreeBytes = ESP.getFreeHeap();
  
  // --- Flash Free ---
  flashFreeBytes = ESP.getFreeSketchSpace();
}

// ============================================================================
// SETUP
// ============================================================================

void setup() {
  Serial.begin(UART_BAUD);
  delay(SETUP_DELAY_MS);

  // Set TZ early so localtime_r() is correct even before WiFiSync begins.
  if (setenv("TZ", TZ_POLAND, 1) == 0) {
    tzset();
  }

  heapBaseline = ESP.getFreeHeap();
  Serial.printf("[diag] baseline_heap=%u\n", heapBaseline);
  ModeManager::logDiag("boot");

  // --- DHT Sensor Init ---
  dht.begin();

  // ===== Menedżer trybów (Wi-Fi/BT) - inicjalizuj WCZEŚNIE =====
  ModeManager::begin(&appState);

  s_prefs.begin("zegar", false);
  showEpicIntro = s_prefs.getBool("epicIntro", true);
  settingsEpicIntroIndex = showEpicIntro ? 0 : 1;

  // ===== RadioModeSwitch - inicjalizacja przełączania trybu =====
  // BĘDZIE NA KONIEC setup() po LCD i UI init!
  RadioModeSwitch::begin();

  // ===== Przywrócenie czasu z RTC WCZEŚNIE (jeśli zapisane) =====
  // Jeśli RadioModeSwitch zapisał czas przed restartem, zastosuj go natychmiast
  uint8_t early_rtc_hours = RadioModeSwitch::getRTCHours();
  uint8_t early_rtc_minutes = RadioModeSwitch::getRTCMinutes();
  uint8_t early_rtc_seconds = RadioModeSwitch::getRTCSeconds();
  if (early_rtc_hours > 0 || early_rtc_minutes > 0 || early_rtc_seconds > 0) {
    if (early_rtc_hours < 24 && early_rtc_minutes < 60 && early_rtc_seconds < 60) {
      hours = early_rtc_hours;
      minutes = early_rtc_minutes;
      seconds = early_rtc_seconds;
      lastTick = millis();
      Serial.printf("[main] Early restore time from RTC: %02d:%02d:%02d\n", hours, minutes, seconds);
      updateSevenSeg();
    } else {
      Serial.printf("[main] Early RTC time invalid: %02d:%02d:%02d - ignoring\n", early_rtc_hours, early_rtc_minutes, early_rtc_seconds);
      RadioModeSwitch::clearRTCTime();
    }
  }

#if UART_LCD_MIRROR
  lcdMirror.begin();
#endif
  lcdFrame.begin();

  // I2C initialization with explicit pins: SDA=21, SCL=22 (GPIO22 now free from I2S after fix)
  const bool i2cClockApplied = I2cShared::initMaster(&Wire, 21, 22, 400000);
  Serial.printf("[main] I2C clock readback: %lu Hz (%s)\n",
                (unsigned long)Wire.getClock(),
                i2cClockApplied ? "applied" : "fallback/mismatch");

  // ===== DS3231: restore system time early (before heavy UI/I2C traffic) =====
  tryRestoreSystemTimeFromDs3231();

  // Tighten hd44780 timings to near-datasheet values.
  lcd.setExecTimes(37, 1520);
  lcd.init();
  lcd.backlight();
  lcd.clear();
  lcdFrame.syncToCurrentFrame();
  LCDIcons::loadPalette(lcd, LCDIcons::Palette::Home);

  if (showEpicIntro) {
    introBegin();
  }

  // --- Encoder init ---
  encoder_begin(ENC_CLK, ENC_DT, ENC_SW);

  // --- Buzzer setup ---
  pinMode(BUZZER_PIN, OUTPUT);
  noTone(BUZZER_PIN);

  // --- 7-Segment setup ---
  initSevenSeg();

  // --- Inicjalizacja statystyk ---
  statsManager.begin();

  // --- STM32 setup ---
  STM32data_begin(uart, UART_BAUD, 16, 17);

  // --- PMS5003 Czujnik pyłu ---
  PMS5003Sensor::begin();
  ENS160AHT21Screen::resetRuntimeData();
  ENS160AHT21Sensor::begin();
  BMP280Sensor::begin();
  bmp280MenuCount = BMP280Sensor::menuItemCount();

  // ===== UI CONTROLLER =====
  UI_Callbacks callbacks;
  callbacks.drawHome            = drawHomeThrottled;
  callbacks.drawMenu            = drawMenu;
  callbacks.drawSetTime         = drawSetTime;
  callbacks.drawAlarm           = drawAlarm;
  callbacks.drawTimer           = drawTimer;
  callbacks.drawStoper          = drawStoper;
  callbacks.drawDebugSTM32      = drawDebugSTM32;
  callbacks.updateSevenSeg      = updateSevenSeg;
  callbacks.updateSevenSegStoper = updateSevenSegStoper;
  callbacks.drawStats           = drawStats;           // Callbacki do UI statystyk
  callbacks.drawSystemResources = drawSystemResources; // Zasoby systemu (RAM/FLASH)

  // Ensure first screen (boot/home) performs a full redraw once
  lcdFrame.forceFullRedrawOnce();
  ui_begin(callbacks);
  // ui_begin() calls drawHome callback already; keep HOME refresh centrally throttled.

  // Turn the backlight on only after the first valid frame is staged.
  lcd.backlight();

#if CORE_DEBUG_LEVEL > 0
  lcdFrame.reportTiming("startup");
#endif

  // Load persisted rotation interval (seconds) from NVS/Preferences if present
  settingsRotationSec = s_prefs.getUShort("homeOverlaySec", (uint16_t)settingsRotationSec);
  if (settingsRotationSec < 1) settingsRotationSec = 1;
  if (settingsRotationSec > 10) settingsRotationSec = 10;
  s_homeOverlaySwitchMs = (unsigned long)settingsRotationSec * 1000UL;
  s_prevSettingsRotationSec = settingsRotationSec;
  settingsAlarmMelodyIndex = loadAlarmMelodyIndexFromPrefs();
  s_prevSettingsAlarmMelodyIndex = settingsAlarmMelodyIndex;
  settingsUiScreenIndex = (int)s_prefs.getUShort("uiScreenMode", (uint16_t)settingsUiScreenIndex);
  if (settingsUiScreenIndex < 0) settingsUiScreenIndex = 0;
  if (settingsUiScreenIndex > 2) settingsUiScreenIndex = 2;
  setHomeUiProfile((uint8_t)settingsUiScreenIndex);
  s_prevSettingsUiScreenIndex = settingsUiScreenIndex;
  mqttEnabled = s_prefs.getBool("mqttEnabled", true);
  settingsMqttMenuIndex = mqttEnabled ? 0 : 1;
  // Load persisted alarms
  alarmsCount = s_prefs.getUShort("alarmCount", 0);
  if (alarmsCount < 0) alarmsCount = 0;
  if (alarmsCount > MAX_ALARMS) alarmsCount = MAX_ALARMS;
  for (int i = 0; i < alarmsCount; ++i) {
    char keyH[12]; char keyM[12]; char keyE[12];
    snprintf(keyH, sizeof(keyH), "a%dh", i);
    snprintf(keyM, sizeof(keyM), "a%dm", i);
    snprintf(keyE, sizeof(keyE), "a%de", i);
    alarms[i].hour = (uint8_t)s_prefs.getUShort(keyH, 7);
    alarms[i].minute = (uint8_t)s_prefs.getUShort(keyM, 0);
    alarms[i].enabled = s_prefs.getBool(keyE, true);
    alarms[i].lastTriggerDay = 0;
  }

  // ===== WiFi / NTP Sync =====
  WiFiSync::setTimeRefs(hours, minutes, seconds, lastTick);        // referencje do zmiennych czasu
  WiFiSync::setOnDone([]() {
    const unsigned long ntpSyncMs = WiFiSync::getLastNtpSyncTime();
    if (ntpSyncMs != 0 && ntpSyncMs != lastSeenNtpSyncMillis) {
      lastSeenNtpSyncMillis = ntpSyncMs;
      scheduleRtcWriteFromSystemTime();
    }
    drawHomeThrottled();
  });
  WiFiSync::begin(WIFI_SSID, WIFI_PASS, NTP_SERVER);

  // ===== MQTT Sync (Core 1) - initialized only in WiFi mode =====
  // MQTTSync will be initialized later in RadioModeSwitch::update() when WiFi mode is confirmed
  Serial.println("[main] MQTT will start when WiFi mode is active");

