Fese673/ZEGAR-ESP32/src/main.cpp
  // ===== RadioModeSwitch inicjalizuje się, ale faktyczna inicjalizacja WiFi/BT =====
  // będzie opóźniona w loop() aby zagwarantować że LCD jest w pełni gotowe
  
  // Synchronizuj radioMode ze stanem RadioModeSwitch na starcie
  if (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

  ModeManager::logDiag("after-setup-radio-ready");
}

// ============================================================================
// LOOP
// ============================================================================

void loop() {
  if (serviceEpicBootSequence()) {
    return;
  }

  if (!bootDiagReprinted && millis() >= 5000UL) {
    bootDiagReprinted = true;
    Serial.printf("[boot] serial alive, i2c=%lu Hz, heap=%u\n",
                  (unsigned long)Wire.getClock(),
                  ESP.getFreeHeap());
  }

  handleHomeEntryIfStateChanged();

  // --- Encoder handling ---
  while (true) {
    const EncoderEvent evt = encoder_update();
    if (evt == ENC_NONE) {
      break;
    }

    // === REGISTER STATS ===
    if (evt == ENC_CLICK || evt == ENC_LONG) {
      statsManager.registerClick();
    } else if (evt == ENC_LEFT) {
      statsManager.registerStepLeft();
    } else if (evt == ENC_RIGHT) {
      statsManager.registerStepRight();
    }

    // Pass event to UI (unless RadioModeSwitch is initializing)
    if (!RadioModeSwitch::isInitializing()) {
      ui_handleEvent(evt);
    }
  }

  // --- Stats update (save to NVS if needed) ---
  statsManager.update();

  // Rotacja zawartości HOME (co 3s) — non-blocking.
  serviceHomeOverlayRotation();

  // HOME LCD refresh (1Hz max, LCD + UART mirror)
  // tickClock() / callbacks mark HOME dirty; this performs the actual draw.
  serviceHomeRedraw();

  // --- System resources update ---
  updateSystemResources();

  // --- PMS5003 update ---
  PMS5003Sensor::update();

  // --- ENS160 + AHT21 update ---
  ENS160AHT21Sensor::update();

  // --- BMP280 update ---
  BMP280Sensor::update();

  // --- Stats screen refresh (live data update) ---
  static unsigned long lastStatsRedraw = 0;
  if ((appState == STATE_STATS_RESOURCES_CPU || appState == STATE_STATS_RESOURCES_RAM ||
       appState == STATE_STATS_RESOURCES_FLASH || appState == STATE_STATS_RESOURCES ||
       // PMS menus and all detail sub-states
       appState == STATE_PMS5003_CF1 || appState == STATE_PMS5003_CF1_PM1 || appState == STATE_PMS5003_CF1_PM25 || appState == STATE_PMS5003_CF1_PM10 ||
       appState == STATE_PMS5003_ATM || appState == STATE_PMS5003_ATM_PM1 || appState == STATE_PMS5003_ATM_PM25 || appState == STATE_PMS5003_ATM_PM10 ||
       appState == STATE_PMS5003_PARTICLES || appState == STATE_PMS5003_PARTICLES_0_3 || appState == STATE_PMS5003_PARTICLES_0_5 || appState == STATE_PMS5003_PARTICLES_1_0 || appState == STATE_PMS5003_PARTICLES_2_5 || appState == STATE_PMS5003_PARTICLES_5_0 || appState == STATE_PMS5003_PARTICLES_10_0 ||
      appState == STATE_PMS5003_TELEMETRY ||
      appState == STATE_ENS160_AHT21 || appState == STATE_ENS160_AHT21_SUMMARY || appState == STATE_ENS160_AHT21_GAS ||
      appState == STATE_ENS160_AHT21_GAS_AQI || appState == STATE_ENS160_AHT21_GAS_TVOC || appState == STATE_ENS160_AHT21_GAS_ECO2 ||
      appState == STATE_ENS160_AHT21_CLIMATE || appState == STATE_ENS160_AHT21_CLIMATE_TEMP || appState == STATE_ENS160_AHT21_CLIMATE_HUM ||
      appState == STATE_ENS160_AHT21_STATUS ||
      appState == STATE_BMP280 || appState == STATE_BMP280_TEMP || appState == STATE_BMP280_PRESSURE ||
      appState == STATE_BMP280_STATUS || appState == STATE_BMP280_ALTITUDE) &&
      millis() - lastStatsRedraw >= 1000) {
    lastStatsRedraw = millis();
    drawStats();
  }

  // --- Timer screen refresh (1s) ---
  static unsigned long lastTimerRedraw = 0;
  if (appState == STATE_TIMER && millis() - lastTimerRedraw >= 1000) {
    lastTimerRedraw = millis();
    if (timerRunning || editState == EDIT_DONE) {
      drawTimer();
    }
  }

  // --- Status diagnostics every 2s (disabled in BT mode to not affect audio) ---
  static unsigned long last_status_diag = 0;
  if (!ModeManager::isBtOn() && (millis() - last_status_diag >= 2000)) {
    last_status_diag = millis();
    static uint32_t last_heap = 0;
    uint32_t current_heap = ESP.getFreeHeap();
    int heap_delta = (int)current_heap - (int)last_heap;
    last_heap = current_heap;
    
    Serial.printf("[STATUS] WiFi:%s MQTT:%s BT:%s Heap:%u (%+d) Mode:%s\n",
      ModeManager::isWifiOn() ? "ON" : "OFF",
      mqtt_initialized ? "ON" : "OFF",
      ModeManager::isBtOn() ? "ON" : "OFF",
      current_heap,
      heap_delta,
      (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) ? "BT" : "WiFi");
  }

#if CORE_DEBUG_LEVEL > 0
  // Report LCD timing in 30-second windows so each print reflects the last
  // full measurement interval, not the startup path.
  static bool lcdTimingPrimed = false;
  static unsigned long lastLcdTimingReport = 0;
  constexpr unsigned long LCD_TIMING_WINDOW_MS = 30000UL;
  if (!lcdTimingPrimed && millis() >= LCD_TIMING_WINDOW_MS) {
    lcdFrame.resetStats();
    lcdTimingPrimed = true;
    lastLcdTimingReport = millis();
  }
  if (lcdTimingPrimed && (millis() - lastLcdTimingReport >= LCD_TIMING_WINDOW_MS)) {
    lastLcdTimingReport = millis();
    lcdFrame.reportTiming("runtime");
    lcdFrame.resetStats();
  }
#endif

  // --- Clock tick ---
  tickClock();

  // --- WiFi sync update ---
  WiFiSync::update();

  // --- Persist current system time to DS3231 when requested ---
  handleRtcWriteIfPending();

  // --- RadioModeSwitch update (delayed WiFi/BT init after startup) ---
  RadioModeSwitch::update();

  // --- MQTT Control (start/stop based on WiFi mode + user setting) ---
  RadioModeSwitchState current_radio_mode = RadioModeSwitch::getCurrentState();

  // Hard switch OFF: stop task and never publish.
  if (!mqttEnabled) {
    if (mqtt_initialized) {
      Serial.println("[main] MQTT disabled in settings -> stopping MQTT task");
      MQTTSync::stopCore1Task();
      mqtt_initialized = false;
    }
  }
  else if (current_radio_mode == RADIO_STATE_WIFI && !mqtt_initialized) {
    // Start MQTT only when WiFi is ACTUALLY connected (not just in WiFi mode)
    // Use periodic timer (every 2s) to avoid lock contention with WiFi.status() calls
    static unsigned long lastWiFiCheck = 0;
    if (millis() - lastWiFiCheck >= 2000) {
      lastWiFiCheck = millis();
      if (WiFi.status() == WL_CONNECTED) {
        Serial.println("[main] WiFi connected! Activating MQTT");
        MQTTSync::begin(WIFI_SSID, WIFI_PASS);
        MQTTSync::startCore1Task();
        mqtt_initialized = true;
        last_radio_mode = RADIO_STATE_WIFI;
      }
    }
  } 
  else if (current_radio_mode == RADIO_STATE_BT && mqtt_initialized) {
    // Stop MQTT when switching to BT mode
    Serial.println("[main] Deactivating MQTT for BT mode");
    MQTTSync::stopCore1Task();
    mqtt_initialized = false;
    last_radio_mode = RADIO_STATE_BT;
  }

  // --- MQTT Update (publish sensor data only if enabled+initialized) ---
  if (mqttEnabled && mqtt_initialized) {
    static unsigned long lastMQTTPublish = 0;
    if (millis() - lastMQTTPublish >= 5000) {
      lastMQTTPublish = millis();
      float mqttTemperature = 0.0f;
      int mqttHumidity = 0;
      int mqttPressure = 0;
      uint8_t mqttAqi = 0;
      uint16_t mqttTvoc = 0;
      uint16_t mqttEco2 = 0;
      buildMqttTelemetrySample(mqttTemperature, mqttHumidity, mqttPressure, mqttAqi, mqttTvoc, mqttEco2);
      MQTTSync::publishSensorData(mqttTemperature, mqttHumidity, mqttPressure, mqttAqi, mqttTvoc, mqttEco2);
    }
  }

  // --- Synchronizuj radioMode ze stanem RadioModeSwitch ---
  // Ważne: to zapewnia, że menu zawsze pokazuje prawidłowy stan
  if (RadioModeSwitch::getCurrentState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

